# Título proyecto

## Introducción

## Importación de librerías

In [1]:
import pandas as pd

## Paso 1: Preparación de datos

### Optimización de datasets

#### Dataset "Visits"

Evalúo primeramente el dataset, el tipo de datos y su tamaño.

In [2]:
df_visits = pd.read_csv('./datasets/visits_log_us.csv')
display(df_visits.head())
df_visits.info(memory_usage='deep')

,Device,End Ts,Source Id,Start Ts,Uid
0,touch,2017-12-20 17:38:00,4,2017-12-20 17:20:00,16879256277535980062
1,desktop,2018-02-19 17:21:00,2,2018-02-19 16:53:00,104060357244891740
2,touch,2017-07-01 01:54:00,5,2017-07-01 01:54:00,7459035603376831527
3,desktop,2018-05-20 11:23:00,9,2018-05-20 10:59:00,16174680259334210214
4,desktop,2017-12-27 14:06:00,3,2017-12-27 14:06:00,9969694820036681168

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359400 entries, 0 to 359399
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Device     359400 non-null  object
 1   End Ts     359400 non-null  object
 2   Source Id  359400 non-null  int64
 3   Start Ts   359400 non-null  object
 4   Uid        359400 non-null  uint64
dtypes: int64(1), object(3), uint64(1)
memory usage: 71.1 MB

In [3]:
df_visits['Device'].value_counts()

Device
desktop    262567
touch       96833
Name: count, dtype: int64

Optimizo el dataset convirtiendo los datos de las columnas tipo "object" a los tipo de datos correctos. Para los datos de la columna "Device", los mismos pueden convertirse al tipo de dato "category", mientras que los datos de las columnas "End Ts" y "Start TS", al ser fechas, se pueden convertir al tipo de dato "datetime"

In [4]:
df_visits = pd.read_csv('./datasets/visits_log_us.csv', dtype={'Device': 'category'}, parse_dates=['Start Ts', 'End Ts'])
display(df_visits.head())
df_visits.info(memory_usage='deep')

,Device,End Ts,Source Id,Start Ts,Uid
0,touch,2017-12-20 17:38:00,4,2017-12-20 17:20:00,16879256277535980062
1,desktop,2018-02-19 17:21:00,2,2018-02-19 16:53:00,104060357244891740
2,touch,2017-07-01 01:54:00,5,2017-07-01 01:54:00,7459035603376831527
3,desktop,2018-05-20 11:23:00,9,2018-05-20 10:59:00,16174680259334210214
4,desktop,2017-12-27 14:06:00,3,2017-12-27 14:06:00,9969694820036681168

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359400 entries, 0 to 359399
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Device     359400 non-null  category
 1   End Ts     359400 non-null  datetime64[ns]
 2   Source Id  359400 non-null  int64
 3   Start Ts   359400 non-null  datetime64[ns]
 4   Uid        359400 non-null  uint64
dtypes: category(1), datetime64[ns](2), int64(1), uint64(1)
memory usage: 11.3 MB

#### Dataset "Orders"

Evalúo primeramente el dataset, el tipo de datos y su tamaño.

In [5]:
df_orders = pd.read_csv('./datasets/orders_log_us.csv')
display(df_orders.head())
df_orders.info(memory_usage='deep')

                Buy Ts  Revenue                   Uid
0  2017-06-01 00:10:00    17.00  10329302124590727494
1  2017-06-01 00:25:00     0.55  11627257723692907447
2  2017-06-01 00:27:00     0.37  17903680561304213844
3  2017-06-01 00:29:00     0.55  16109239769442553005
4  2017-06-01 07:58:00     0.37  14200605875248379450

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50415 entries, 0 to 50414
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Buy Ts   50415 non-null  object
 1   Revenue  50415 non-null  float64
 2   Uid      50415 non-null  uint64
dtypes: float64(1), object(1), uint64(1)
memory usage: 4.0 MB

Para este dataset, la conversión de datos sería solamente en la columna de "Buy Ts", que contiene fechas.

In [6]:
df_orders = pd.read_csv('./datasets/orders_log_us.csv', parse_dates=['Buy Ts'])
display(df_orders.head())
df_orders.info(memory_usage='deep')

               Buy Ts  Revenue                   Uid
0 2017-06-01 00:10:00    17.00  10329302124590727494
1 2017-06-01 00:25:00     0.55  11627257723692907447
2 2017-06-01 00:27:00     0.37  17903680561304213844
3 2017-06-01 00:29:00     0.55  16109239769442553005
4 2017-06-01 07:58:00     0.37  14200605875248379450

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50415 entries, 0 to 50414
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Buy Ts   50415 non-null  datetime64[ns]
 1   Revenue  50415 non-null  float64
 2   Uid      50415 non-null  uint64
dtypes: datetime64[ns](1), float64(1), uint64(1)
memory usage: 1.2 MB

#### Dataset "Costs"

Evalúo primeramente el dataset, el tipo de datos y su tamaño.

In [7]:
df_costs = pd.read_csv('./datasets/costs_us.csv')
display(df_costs.head())
df_costs.info(memory_usage='deep')

   source_id          dt  costs
0          1  2017-06-01  75.20
1          1  2017-06-02  62.25
2          1  2017-06-03  36.53
3          1  2017-06-04  55.00
4          1  2017-06-05  57.08

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2542 entries, 0 to 2541
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   source_id  2542 non-null   int64
 1   dt         2542 non-null   object
 2   costs      2542 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 186.3 KB

Para este dataset, la conversión de datos sería solamente en la columna de "dt", que contiene fechas.

In [8]:
df_costs = pd.read_csv('./datasets/costs_us.csv', parse_dates=['dt'])
display(df_costs.head())
df_costs.info(memory_usage='deep')

   source_id         dt  costs
0          1 2017-06-01  75.20
1          1 2017-06-02  62.25
2          1 2017-06-03  36.53
3          1 2017-06-04  55.00
4          1 2017-06-05  57.08

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2542 entries, 0 to 2541
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   source_id  2542 non-null   int64
 1   dt         2542 non-null   datetime64[ns]
 2   costs      2542 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 59.7 KB

### Visualización de datos y detección de errores

Para cada dataset, se aplicará una función para detectar errores en los datos, y ajustar los nombres de las columnas al formato 'snake_case'.  
Posteriormente, se hará una visualización de los datos, y exploración inicial de los mismos con el método describe().

In [9]:
def error_detection(df): #Función para detectar errores en dataset y convertir todos los títulos de columnas en convención snake_case
    #Detección de valores ausentes por columna:
    for column in df:
        print(f'Valores ausentes en columna {column}:', df[column].isna().sum())
    print()
    #Detección de filas duplicadas:
    print('Cantidad de filas duplicadas:', df.duplicated().sum())
    print()
    #Cambiar formato erróneo en nombres de columnas:
    new_col_name = {}
    for column in df:
        new_col_name[column]= column.strip().lower().replace(' ', '_')
    df.rename(columns=new_col_name, inplace=True)
    return df

#### Dataset "Visits"

Detección de errores:

In [10]:
error_detection(df_visits)

Valores ausentes en columna Device: 0
Valores ausentes en columna End Ts: 0
Valores ausentes en columna Source Id: 0
Valores ausentes en columna Start Ts: 0
Valores ausentes en columna Uid: 0

Cantidad de filas duplicadas: 0

,device,end_ts,source_id,start_ts,uid
0,touch,2017-12-20 17:38:00,4,2017-12-20 17:20:00,16879256277535980062
1,desktop,2018-02-19 17:21:00,2,2018-02-19 16:53:00,104060357244891740
2,touch,2017-07-01 01:54:00,5,2017-07-01 01:54:00,7459035603376831527
3,desktop,2018-05-20 11:23:00,9,2018-05-20 10:59:00,16174680259334210214
4,desktop,2017-12-27 14:06:00,3,2017-12-27 14:06:00,9969694820036681168
...,...,...,...,...,...
359395,desktop,2017-07-29 19:07:19,2,2017-07-29 19:07:00,18363291481961487539
359396,touch,2018-01-25 17:38:19,1,2018-01-25 17:38:00,18370831553019119586
359397,desktop,2018-03-03 10:12:19,4,2018-03-03 10:12:00,18387297585500748294
359398,desktop,2017-11-02 10:12:19,5,2017-11-02 10:12:00,18388616944624776485
359399,touch,2017-09-10 13:13:19,2,2017-09-10 13:13:00,18396128934054549559

Conclusión:  
* El dataset no presenta valores ausentes  
* El dataset no presenta filas duplicadas
* Los nombres de las columnas se modificaron para adoptar el estilo 'snake_case'

Dado que este dataset contiene datos de fechas de sesión, tipo de dispositivo, id de la fuente de anuncio e id de usuario, aplicar el método describe() no representaría información útil para el análisis, por lo que no se aplica el mismo al presente dataset

#### Dataset "Orders"

Detección de errores:

In [11]:
error_detection(df_orders)

Valores ausentes en columna Buy Ts: 0
Valores ausentes en columna Revenue: 0
Valores ausentes en columna Uid: 0

Cantidad de filas duplicadas: 0

                   buy_ts  revenue                   uid
0     2017-06-01 00:10:00    17.00  10329302124590727494
1     2017-06-01 00:25:00     0.55  11627257723692907447
2     2017-06-01 00:27:00     0.37  17903680561304213844
3     2017-06-01 00:29:00     0.55  16109239769442553005
4     2017-06-01 07:58:00     0.37  14200605875248379450
...                   ...      ...                   ...
50410 2018-05-31 23:50:00     4.64  12296626599487328624
50411 2018-05-31 23:50:00     5.80  11369640365507475976
50412 2018-05-31 23:54:00     0.30   1786462140797698849
50413 2018-05-31 23:56:00     3.67   3993697860786194247
50414 2018-06-01 00:02:00     3.42     83872787173869366

[50415 rows x 3 columns]

Conclusión:  
* El dataset no presenta valores ausentes  
* El dataset no presenta filas duplicadas
* Los nombres de las columnas se modificaron para adoptar el estilo 'snake_case'

Para este dataset, el método describe() puede ser útil para la columna 'revenue', por lo que se aplica a continuación únicamente para dicha columna:

In [15]:
df_orders['revenue'].describe()

count    50415.000000
mean         4.999647
std         21.818359
min          0.000000
25%          1.220000
50%          2.500000
75%          4.890000
max       2633.280000
Name: revenue, dtype: float64

#### Dataset "Costs"

Detección de errores:

In [12]:
error_detection(df_costs)

Valores ausentes en columna source_id: 0
Valores ausentes en columna dt: 0
Valores ausentes en columna costs: 0

Cantidad de filas duplicadas: 0

      source_id         dt  costs
0             1 2017-06-01  75.20
1             1 2017-06-02  62.25
2             1 2017-06-03  36.53
3             1 2017-06-04  55.00
4             1 2017-06-05  57.08
...         ...        ...    ...
2537         10 2018-05-27   9.92
2538         10 2018-05-28  21.26
2539         10 2018-05-29  11.32
2540         10 2018-05-30  33.15
2541         10 2018-05-31  17.60

[2542 rows x 3 columns]

Conclusión:  
* El dataset no presenta valores ausentes  
* El dataset no presenta filas duplicadas
* Los nombres de las columnas ya respetaban el estilo 'snake_case'

Para este dataset, el método describe() puede ser útil para la columna 'costs', por lo que se aplica a continuación únicamente para dicha columna:

In [16]:
df_costs['costs'].describe()

count    2542.000000
mean      129.477427
std       156.296628
min         0.540000
25%        21.945000
50%        77.295000
75%       170.065000
max      1788.280000
Name: costs, dtype: float64

## Paso 2: Informes y métricas